VuongSun/STM8S003F3/FWLib/include/STM8_TSL_RC_Services.c
  u8 K_Filter, K_Filter_Complement;
  s8 ECS_Fast_Direction, ECS_Fast_Enable;
  u32 IIR_Result;

  disableInterrupts();
  Local_TickECS10ms = TSL_TickCount_ECS_10ms;
  TSL_TickCount_ECS_10ms = 0;
  enableInterrupts();

  while ( Local_TickECS10ms-- )
  {
    ECSTimeStepCounter--;
    ECSTempoPrescaler--;
    if ( !ECSTempoPrescaler )
    {
      ECSTempoPrescaler = 10;
      if ( ECSTempoCounter )
        ECSTempoCounter--;
    }

    K_Filter = ECS_K_Slow;   // Default case !
    ECS_Fast_Enable = 1;
    ECS_Fast_Direction = 0;
    for ( KeyIndex = 0; KeyIndex < NUMBER_OF_SINGLE_CHANNEL_KEYS; KeyIndex++ )
    {
      TSL_SetStructPointer();
      // If any key is in DETECT state, ECS is disabled !
      if ( pKeyStruct->State.whole & DETECTED_STATE)
	  {
        ECSTempoCounter = ECSTemporization;    // Restart temporization counter ...
        break;           // Out from the for loop
      }
      if ( pKeyStruct->State.whole == IDLE_STATE )
      {
        TSL_DeltaCalculation();
        if ( Delta == 0 )  // No Fast ECS !
          ECS_Fast_Enable = 0;
        else
        {
          if ( Delta < 0 )
          {
            if ( ECS_Fast_Direction > 0 )  // No Fast ECS !
              ECS_Fast_Enable = 0;
            else
              ECS_Fast_Direction = -1;
          }
          else
          {
            if ( ECS_Fast_Direction < 0 )  // No Fast ECS !
              ECS_Fast_Enable = 0;
            else
              ECS_Fast_Direction = + 1;
          }
        }
      }
    }

#if NUMBER_OF_MULTI_CHANNEL_KEYS > 0
    for ( KeyIndex = 0; KeyIndex < NUMBER_OF_MULTI_CHANNEL_KEYS; KeyIndex++ )
    {
      TSL_MCKey_SetStructPointer();
      if ( pMCKeyStruct->State.whole & DETECTED_STATE )      	  
      {
        ECSTempoCounter = ECSTemporization;    // Restart temporization counter ...
        break;           // Out from the for loop
      }
      if ( pMCKeyStruct->State.whole == IDLE_STATE )
      {
        for ( ChannelIndex = 0; ChannelIndex < CHANNEL_PER_MCKEY; ChannelIndex++ )
        {
          TSL_MCKey_DeltaCalculation( ChannelIndex );
          Delta1 += Delta;
        }
        if ( Delta1 == 0 )
        {   // No Fast ECS !
          ECS_Fast_Enable = 0;
        }
        else
        {
          if ( Delta1 < 0 )
          {
            if ( ECS_Fast_Direction > 0 )
            {   // No Fast ECS !
              ECS_Fast_Enable = 0;
            }
            else
              ECS_Fast_Direction = -1;
          }
          else
          {
            if ( ECS_Fast_Direction < 0 )
            {   // No Fast ECS !
              ECS_Fast_Enable = 0;
            }
            else
              ECS_Fast_Direction = + 1;
          }
        }
      }
    }
#endif

    if ( !ECSTimeStepCounter && !ECSTempoCounter )
    {
      ECSTimeStepCounter = ECSTimeStep;

      if (ECS_Fast_Enable)
      {
        K_Filter = ECS_K_Fast;
      }

      K_Filter_Complement = (u8)((0xFF ^ K_Filter) + 1);

      if ( K_Filter )
      {
        // Apply filter to generate new reference value.
        for ( KeyIndex = 0; KeyIndex < NUMBER_OF_SINGLE_CHANNEL_KEYS; KeyIndex++ )
        {
          TSL_SetStructPointer();
          if ( pKeyStruct->State.whole == IDLE_STATE )
          {
            IIR_Result = ((u32)(pKeyStruct->Channel.Reference) << 8) + pKeyStruct->Channel.ECSRefRest;
            IIR_Result = K_Filter_Complement * IIR_Result;
            IIR_Result += K_Filter * ((u32)(pKeyStruct->Channel.LastMeas) << 8);
            pKeyStruct->Channel.Reference = (u16)(IIR_Result >> 16);
            pKeyStruct->Channel.ECSRefRest = (u8)(IIR_Result >> 8);
          }
        }
#if NUMBER_OF_MULTI_CHANNEL_KEYS > 0
        for ( KeyIndex = 0; KeyIndex < NUMBER_OF_MULTI_CHANNEL_KEYS; KeyIndex++ )
        {
          TSL_MCKey_SetStructPointer();
          if ( pMCKeyStruct->State.whole == IDLE_STATE )
          {
            for ( ChannelIndex = 0; ChannelIndex < CHANNEL_PER_MCKEY; ChannelIndex++ )
            {
              IIR_Result = ((u32)(pMCKeyStruct->Channel[ChannelIndex].Reference) << 8) + pMCKeyStruct->Channel[ChannelIndex].ECSRefRest;
              IIR_Result = K_Filter_Complement * IIR_Result;
              IIR_Result += K_Filter * ((u32)(pMCKeyStruct->Channel[ChannelIndex].LastMeas) << 8);
              pMCKeyStruct->Channel[ChannelIndex].Reference = (u16)(IIR_Result >> 16);
              pMCKeyStruct->Channel[ChannelIndex].ECSRefRest = (u8)(IIR_Result >> 8);
            }
          }
        }
#endif
      }
    }
  }
}


/**
  ******************************************************************************
  * @brief Apply Detection Exclusion System algorithm (DES).
  * This function modify the LOCKED bit of current Key structure only.
  * @par Parameters:
  * None
  * @retval void None
  * @par Required preconditions:
  * None
  ******************************************************************************
  */
void TSL_SCKey_DES(void)
{

  u8 DESGroupMask, KeyToCheck;

  if ( pKeyStruct->Setting.b.LOCKED )
    return;

  DESGroupMask = pKeyStruct->DESGroup;

  for ( KeyToCheck = 0; KeyToCheck < NUMBER_OF_SINGLE_CHANNEL_KEYS; KeyToCheck++ )
  {
    if ( KeyToCheck != KeyIndex )
    {
      // KeyToCheck and current key are in same group ?
      if ( sSCKeyInfo[KeyToCheck].DESGroup & DESGroupMask )
      {
        if ( sSCKeyInfo[KeyToCheck].Setting.b.LOCKED )
        {
          goto ExitToIdle;
        }
      }
    }
  }

#if NUMBER_OF_MULTI_CHANNEL_KEYS > 0
  for ( KeyToCheck = 0; KeyToCheck < NUMBER_OF_MULTI_CHANNEL_KEYS; KeyToCheck++ )
  {
    // KeyToCheck and current key are in same group ?
    if ( sMCKeyInfo[KeyToCheck].DESGroup & DESGroupMask )
    {
      if ( sMCKeyInfo[KeyToCheck].Setting.b.LOCKED )
      {
        goto ExitToIdle;
      }
    }
  }
#endif

  pKeyStruct->Setting.b.LOCKED = 1;
  return;

ExitToIdle:   // The DES is verified at PRE DETECT state only !
  pKeyStruct->Channel.IntegratorCounter++;  // Increment integrator to never allow DETECT state
  return;
}


/**
  ******************************************************************************
  * @brief Verify Detection Timeout for current Key.
  * @par Parameters:
  * None
  * @retval void None
  * @par Required preconditions:
  * None
  ******************************************************************************
  */
void TSL_SCKey_DetectionTimeout(void)
{
  if ( Local_TickFlag.b.DTO_1sec )
  {
    if ( DetectionTimeout )
    {
      pKeyStruct->Counter--;
      if ( !pKeyStruct->Counter )
      {
        TSL_SCKey_SetCalibrationState( );
      }
    }
  }
}

//============================================================================
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//-----             MULTI CHANNEL KEY SERVICES                           -----
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//============================================================================

//============================================================================
//-----         CONDITIONAL COMPILING FOR MCKEYS !!!               -----------
#if NUMBER_OF_MULTI_CHANNEL_KEYS > 0
//============================================================================

